benchmarksuite/acceleration/sloshingSinWaveTet/sinWaveTet/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include       "$FOAM_CASE/system/simulationParameters"

phases (water air);

water
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 0;
    rho             rho [ 1 -3 0 0 0 0 0 ] 1000;
}

air
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 0;
    rho             rho [ 1 -3 0 0 0 0 0 ] 1;

}

sigma           sigma [ 1 0 -2 0 0 0 0 ] 0;

surfaceForces
{
  sigma 0;
  surfaceTensionForceModel $SURFTENMODEL;
  accelerationModel $GRAVITYMODEL;
}


// ************************************************************************* //
