benchmarksuite/acceleration/sloshingSinWaveTet/sinWaveTet/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "simulationParameters"

scale 1;

vertices        
(
    (-1 -3 -0.1)
    (1 -3 -0.1)
    (1 3 -0.1)
    (-1 3 -0.1)
    (-1 -3 0.1)
    (1 -3 0.1)
    (1 3 0.1)
    (-1 3 0.1)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 1)
);

edges           
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (

            (0 4 7 3)
            (1 2 6 5)
            (0 1 5 4)
            (3 7 6 2)
        );
    }


    frontAndBack
    {
	type empty;
	faces
	(
            (0 3 2 1)
            (4 5 6 7)
	);
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
