benchmarksuite/acceleration/sloshingSinWaveTet/sinWaveTet/system/setAlphaFieldDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
field               alpha.water;
type                sin;
period              4; 
direction           (1 0 0);
up                  (0 1 0);
phase               0; 
origin              (0 0 0);
amplitude           1e-1;

// ************************************************************************* //
