benchmarksuite/acceleration/sloshingSinWaveTet/sinWaveTet/system/simulationParameters
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      simulationParameters;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

nx	40;
ny	120;
nz	1;

MethodType      geometricVoFMethod;
advectStrat     isoAdvection;
reconStrat      plicRDF;
SURFTENMODEL    Brackbill;
GRAVITYMODEL    staticGravityPLIC; //staticGravityPLIC staticGravityPLIC
MAXCFL          0.1;

// ************************************************************************* //
